<?php
/**
 * This file is part of Swoft.
 *
 * @link https://swoft.org
 * @document https://doc.swoft.org
 * @contact group@swoft.org
 * @license https://github.com/swoft-cloud/swoft/blob/master/LICENSE
 * Desc: 推荐供应商列表定时生成任务
 */

namespace App\Tasks;

use App\Models\Logic\UserLogic;
use Swoft\Bean\Annotation\Inject;
use Swoft\Log\Log;
use Swoft\Task\Bean\Annotation\Scheduled;
use Swoft\Task\Bean\Annotation\Task;

/**
 * Class RecommendShopTask
 *
 * @Task("RecommendShopTask")
 * @package App\Tasks
 */
class RecommendShopTask
{

    /**
     * @Inject()
     * @var UserLogic
     */
    private $userLogic;

    /**
     * 供应商推荐池任务
     * @author Nihuan
     * @Scheduled(cron="0 0 5 * * *")
     * @throws \Swoft\Db\Exception\DbException
     */
    public function generalShopTask()
    {
        $tag_list = $this->tag_list();
        $user_list = $this->userLogic->getStrengthUserList();
        $user_ids = array_column($user_list, 'user_id');
        $last_days = strtotime('-30 day');
        foreach ($tag_list as $key => $item) {
           $this->userLogic->getRecommendUserList($user_ids, $key, $item, $last_days);
        }
    }

    /**
     * 标签列表
     * @return array
     */
    private function tag_list()
    {
        return ['罗纹' => 30, '平纹布' => 40, '亚麻布' => 20, '双面呢' => 20, '欧根纱' => 10, '春亚纺' => 20, '普通蕾丝' => 20, 'PU' => 10, '无纺布' => 0, '纺织填充物' => 0, '印染' => 10, '双面布' => 40, '斜纹布' => 40, '麻棉弹力' => 30, '单面呢' => 20, '乔其' => 10, '四面弹' => 40, '花边' => 15, '皮革' => 10, '毛毡' => 0, '衬布' => 0, '印花' => 0, '汗布' => 30, '缎纹' => 20, '绉布' => 40, '羊绒' => 15, '重磅真丝' => 15, '羽绒服、棉服面料' => 20, '网布' => 30, '麂皮绒' => 15, '窗帘面料' => 0, '肩垫' => 0, '定型' => 0, '格子布' => 40, '苎麻布' => 20, '其他全毛面料' => 20, '双绉' => 30, '桃皮绒' => 15, '水溶' => 15, '鹿皮绒' => 10, '窗纱' => 10, '毛领' => 15, '司马克' => 0, '珠地' => 20, '纱卡' => 20, '汉麻布' => 20, '顺毛呢' => 20, '丝绒' => 30, '牛津纺' => 30, '网纱' => 30, '仿皮绒' => 15, '特种面料' => 10, '帽条' => 10, '绗缝' => 10, '针织牛仔' => 20, '破卡' => 30, '其他麻纺面料' => 0, '凤凰呢' => 20, '香云纱' => 10, '其他尼龙面料' => 10, '锦棉蕾丝' => 10, '真皮' => 0, '汽车内饰材料' => 0, '毛球' => 20, '绣花' => 15, '针织提花' => 30, '牛仔布' => 20, '麻料混纺' => 20, '龙凤呢' => 20, '双乔' => 15, '功能布' => 15, '股线蕾丝' => 15, '皮绒' => 15, '箱包、鞋材料' => 0, '拉链' => 10, '冲孔' => 10, '拉毛布' => 20, '灯芯绒' => 30, '圈圈呢' => 25, '弹力缎' => 15, '塔丝绒' => 20, '睫毛蕾丝' => 15, '皮毛' => 15, '地毯' => 10, '拉链头' => 10, '烧花' => 10, '粗针' => 20, '梭织植绒' => 20, '印花呢料' => 20, '色丁' => 30, '水洗绒' => 15, '牛奶丝绣花' => 15, '水洗皮' => 15, '家纺' => 0, '钮扣' => 0, '水洗' => 10, '平板布' => 20, '梭织提花' => 40, '针织毛呢' => 25, '玻璃纱' => 20, '雪纺' => 40, '蕾丝复合' => 20, '仿皮' => 20, '编织布' => 10, '魔术贴' => 10, '窗帘加工' => 10, '空气层' => 30, '梭织印花' => 30, '绒布' => 0, '蚕丝缎' => 15, '花瑶绉' => 20, '锦氨蕾丝' => 15, '人造毛' => 0, '工程布' => 10, '流苏、穗' => 0, '服装加工' => 10, '三明治' => 20, '麦尔登呢' => 15, '锦缎' => 20, '仿麻布' => 20, '流苏蕾丝' => 15, '墙布' => 20, '毛衫加工' => 10, '卫衣布' => 30, '弹力布' => 30, '其他毛呢面料' => 20, '顺纡绉' => 20, '其他涤纶面料' => 15, '满幅(幅花)' => 10, 'TPU材料' => 10, '织带' => 10, '烫金' => 15, '其他针织面料' => 30, '棉布' => 30, '斜纹呢' => 20, '丝绸' => 15, '涤光丝' => 15, '飞织布' => 10, '松紧带' => 10, '植绒' => 20, '卡其布' => 20, '人字呢' => 25, '真丝面料' => 15, '弹力绉' => 20, '绣品' => 15, '装饰布' => 10, '其他带子类' => 0, '珠片绣' => 40, '彩棉针织' => 20, '衬衫布' => 25, '华达呢' => 20, '醋酸面料' => 30, '棉布绣花' => 15, '篷布' => 10, '绳子类' => 0, '毛巾绣' => 20, '色织布' => 40, '抗绉布' => 20, '粗纺' => 30, '条子布' => 40, '线类' => 0, '盘带绣' => 10, '工装面料' => 20, '格子呢' => 25, '人丝乔其' => 15, '镂空绣' => 15, '亮片' => 10, '激光冲孔' => 10, '其他呢料' => 25, '人棉印花' => 25, '蕾丝绣花' => 20, '烫图、烫钻' => 0, '羽绒服加工' => 0, '其他棉纺' => 0, '其他毛纺面料' => 20, '其他粘胶（人棉）面料' => 20, '吊粒、吊牌' => 0, '毛衣订做' => 0, '棉类混纺' => 0, '其他化纤面料' => 30, '洗唛、商标' => 0, '滴塑加工厂' => 10, '布贴' => 0, '压花' => 0, '服装饰品' => 0, '涂层' => 10, '其他纺织辅料' => 0, '复合加工' => 15, '滴塑' => 15, '压胶' => 10, '烫钻' => 10, '烫画' => 10, '围巾加工' => 10];
    }
}
